[["CVE-2021-20283", "", "???", "The web service responsible for fetching other users' enrolled courses did not validate that the requesting user had permission to view that information in each course in moodle before 3.10.2, 3.9.5, 3.8.8, 3.5.17.", ["32", "34"], ["https://www.cvedetails.com/cve/CVE-2021-20283/"], 0], ["CVE-2021-20282", "", "Not required", "When creating a user account, it was possible to verify the account without having access to the verification email link/secret in moodle before 3.10.2, 3.9.5, 3.8.8, 3.5.17.", ["32", "34"], ["https://www.cvedetails.com/cve/CVE-2021-20282/"], 0], ["CVE-2021-20281", "+Info", "Not required", "It was possible for some users without permission to view other users' full names to do so via the online users block in moodle before 3.10.2, 3.9.5, 3.8.8, 3.5.17.", ["32", "34"], ["https://www.cvedetails.com/cve/CVE-2021-20281/"], 0], ["CVE-2021-20280", "XSS", "???", "Text-based feedback answers required additional sanitizing to prevent stored XSS and blind SSRF risks in moodle before 3.10.2, 3.9.5, 3.8.8, 3.5.17.", ["32", "34"], ["https://www.cvedetails.com/cve/CVE-2021-20280/"], 0], ["CVE-2021-20279", "XSS", "???", "The ID number user profile field required additional sanitizing to prevent a stored XSS risk in moodle before 3.10.2, 3.9.5, 3.8.8, 3.5.17.", ["32", "34"], ["https://www.cvedetails.com/cve/CVE-2021-20279/"], 0], ["CVE-2021-20187", "", "???", "It was found in Moodle before version 3.10.1, 3.9.4, 3.8.7 and 3.5.16 that it was possible for site administrators to execute arbitrary PHP scripts via a PHP include used during Shibboleth authentication.", [], ["https://www.cvedetails.com/cve/CVE-2021-20187/"], 0], ["CVE-2021-20186", "XSS", "???", "It was found in Moodle before version 3.10.1, 3.9.4, 3.8.7 and 3.5.16 that if the TeX notation filter was enabled, additional sanitizing of TeX content was required to prevent the risk of stored XSS.", [], ["https://www.cvedetails.com/cve/CVE-2021-20186/"], 0], ["CVE-2021-20185", "DoS", "Not required", "It was found in Moodle before version 3.10.1, 3.9.4, 3.8.7 and 3.5.16 that messaging did not impose a character limit when sending messages, which could result in client-side (browser) denial of service for users receiving very large messages.", [], ["https://www.cvedetails.com/cve/CVE-2021-20185/"], 0], ["CVE-2021-20184", "", "???", "It was found in Moodle before version 3.10.1, 3.9.4 and 3.8.7 that a insufficient capability checks in some grade related web services meant students were able to view other students grades.", [], ["https://www.cvedetails.com/cve/CVE-2021-20184/"], 0], ["CVE-2021-20183", "XSS", "Not required", "It was found in Moodle before version 3.10.1 that some search inputs were vulnerable to reflected XSS due to insufficient escaping of search queries.", [], ["https://www.cvedetails.com/cve/CVE-2021-20183/"], 0], ["CVE-2020-25703", "+Info", "Not required", "The participants table download in Moodle always included user emails, but should have only done so when users' emails are not hidden. Versions affected: 3.9 to 3.9.2, 3.8 to 3.8.5 and 3.7 to 3.7.8. This is fixed in moodle 3.9.3, 3.8.6, 3.7.9, and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25703/"], 0], ["CVE-2020-25702", "XSS", "Not required", "In Moodle, it was possible to include JavaScript when re-naming content bank items. Versions affected: 3.9 to 3.9.2. This is fixed in moodle 3.9.3 and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25702/"], 0], ["CVE-2020-25701", "", "Not required", "If the upload course tool in Moodle was used to delete an enrollment method which did not exist or was not already enabled, the tool would erroneously enable that enrollment method. This could lead to unintended users gaining access to the course. Versions affected: 3.9 to 3.9.2, 3.8 to 3.8.5, 3.7 to 3.7.8, 3.5 to 3.5.14 and earlier unsupported versions. This is fixed in moodle 3.9.3, 3.8.6, 3.7.9, 3.5.15, and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25701/"], 0], ["CVE-2020-25700", "Sql", "???", "In moodle, some database module web services allowed students to add entries within groups they did not belong to. Versions affected: 3.9 to 3.9.2, 3.8 to 3.8.5, 3.7 to 3.7.8, 3.5 to 3.5.14 and earlier unsupported versions. This is fixed in moodle 3.8.6, 3.7.9, 3.5.15, and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25700/"], 0], ["CVE-2020-25699", "", "Not required", "In moodle, insufficient capability checks could lead to users with the ability to course restore adding additional capabilities to roles within that course. Versions affected: 3.9 to 3.9.2, 3.8 to 3.8.5, 3.7 to 3.7.8, 3.5 to 3.5.14 and earlier unsupported versions. This is fixed in moodle 3.9.3, 3.8.6, 3.7.9, 3.5.15, and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25699/"], 0], ["CVE-2020-25698", "", "Not required", "Users' enrollment capabilities were not being sufficiently checked in Moodle when they are restored into an existing course. This could lead to them unenrolling users without having permission to do so. Versions affected: 3.5 to 3.5.14, 3.7 to 3.7.8, 3.8 to 3.8.5, 3.9 to 3.9.2 and earlier unsupported versions. Fixed in 3.9.3, 3.8.6, 3.7.9, 3.5.15, and 3.10.", ["32", "33"], ["https://www.cvedetails.com/cve/CVE-2020-25698/"], 0], ["CVE-2020-25631", "XSS", "Not required", "A vulnerability was found in Moodle 3.9 to 3.9.1, 3.8 to 3.8.4 and 3.7 to 3.7.7 where it was possible to include JavaScript in a book's chapter title, which was not escaped on the \"Add new chapter\" page. This is fixed in 3.9.2, 3.8.5 and 3.7.8.", [], ["https://www.cvedetails.com/cve/CVE-2020-25631/"], 0], ["CVE-2020-25630", "DoS", "Not required", "A vulnerability was found in Moodle where the decompressed size of zip files was not checked against available user quota before unzipping them, which could lead to a denial of service risk. This affects versions 3.9 to 3.9.1, 3.8 to 3.8.4, 3.7 to 3.7.7, 3.5 to 3.5.13 and earlier unsupported versions. Fixed in 3.9.2, 3.8.5, 3.7.8 and 3.5.14.", [], ["https://www.cvedetails.com/cve/CVE-2020-25630/"], 0], ["CVE-2020-25629", "", "???", "A vulnerability was found in Moodle where users with \"Log in as\" capability in a course context (typically, course managers) may gain access to some site administration capabilities by \"logging in as\" a System manager. This affects 3.9 to 3.9.1, 3.8 to 3.8.4, 3.7 to 3.7.7, 3.5 to 3.5.13 and earlier unsupported versions. This is fixed in 3.9.2, 3.8.5, 3.7.8 and 3.5.14.", [], ["https://www.cvedetails.com/cve/CVE-2020-25629/"], 0], ["CVE-2020-25628", "XSS", "Not required", "The filter in the tag manager required extra sanitizing to prevent a reflected XSS risk. This affects 3.9 to 3.9.1, 3.8 to 3.8.4, 3.7 to 3.7.7, 3.5 to 3.5.13 and earlier unsupported versions. Fixed in 3.9.2, 3.8.5, 3.7.8 and 3.5.14.", [], ["https://www.cvedetails.com/cve/CVE-2020-25628/"], 0], ["CVE-2020-25627", "XSS", "Not required", "The moodlenetprofile user profile field required extra sanitizing to prevent a stored XSS risk. This affects versions 3.9 to 3.9.1. Fixed in 3.9.2.", [], ["https://www.cvedetails.com/cve/CVE-2020-25627/"], 0], ["CVE-2020-10738", "Exec Code", "???", "A flaw was found in Moodle versions 3.8 before 3.8.3, 3.7 before 3.7.6, 3.6 before 3.6.10, 3.5 before 3.5.12 and earlier unsupported versions. It was possible to create a SCORM package in such a way that when added to a course, it could be interacted with via web services in order to achieve remote code execution.", [], ["https://www.cvedetails.com/cve/CVE-2020-10738/"], 0], ["CVE-2020-1692", "+Info", "???", "Moodle before version 3.7.2 is vulnerable to information exposure of service tokens for users enrolled in the same course.", [], ["https://www.cvedetails.com/cve/CVE-2020-1692/"], 0], ["CVE-2019-18210", "XSS", "???", "Persistent XSS in /course/modedit.php of Moodle through 3.7.2 allows authenticated users (Teacher and above) to inject JavaScript into the session of another user (e.g., enrolled student or site administrator) via the introeditor[text] parameter. NOTE: the discoverer and vendor disagree on whether Moodle customers have a reasonable expectation that anyone authenticated as a Teacher can be trusted with the ability to add arbitrary JavaScript (this ability is not documented on Moodle's Teacher_role page). Because the vendor has this expectation, they have stated \"this report has been closed as a false positive, and not a bug.\"", [], ["https://www.cvedetails.com/cve/CVE-2019-18210/"], 0], ["CVE-2019-14884", "XSS", "Not required", "A vulnerability was found in Moodle 3.7 before 3.73, 3.6 before 3.6.7 and 3.5 before 3.5.9, where a reflected XSS possible from some fatal error messages.", [], ["https://www.cvedetails.com/cve/CVE-2019-14884/"], 0], ["CVE-2019-14883", "", "Not required", "A vulnerability was found in Moodle 3.6 before 3.6.7 and 3.7 before 3.7.3, where tokens used to fetch inline atachments in email notifications were not disabled when a user's account was no longer active. Note: to access files, a user would need to know the file path, and their token.", [], ["https://www.cvedetails.com/cve/CVE-2019-14883/"], 0], ["CVE-2019-14882", "", "Not required", "A vulnerability was found in Moodle 3.7 to 3.7.3, 3.6 to 3.6.7, 3.5 to 3.5.9 and earlier where an open redirect existed in the Lesson edit page.", [], ["https://www.cvedetails.com/cve/CVE-2019-14882/"], 0], ["CVE-2019-14881", "XSS", "Not required", "A vulnerability was found in moodle 3.7 before 3.7.3, where there is blind XSS reflected in some locations where user email is displayed.", [], ["https://www.cvedetails.com/cve/CVE-2019-14881/"], 0], ["CVE-2019-14880", "", "Not required", "A vulnerability was found in Moodle versions 3.7 before 3.7.3, 3.6 before 3.6.7, 3.5 before 3.5.9 and earlier. OAuth 2 providers who do not verify users' email address changes require additional verification during sign-up to reduce the risk of account compromise.", [], ["https://www.cvedetails.com/cve/CVE-2019-14880/"], 0], ["CVE-2019-14879", "", "???", "A vulnerability was found in Moodle versions 3.7.x before 3.7.3, 3.6.x before 3.6.7 and 3.5.x before 3.5.9. When a cohort role assignment was removed, the associated capabilities were not being revoked (where applicable).", [], ["https://www.cvedetails.com/cve/CVE-2019-14879/"], 0], ["CVE-2019-14831", "", "Not required", "A vulnerability was found in Moodle 3.7 to 3.7.1, 3.6 to 3.6.5, 3.5 to 3.5.7 and earlier unsupported versions, where forum subscribe link contained an open redirect if forced subscription mode was enabled. If a forum's subscription mode was set to \"forced subscription\", the forum's subscribe link contained an open redirect.", [], ["https://www.cvedetails.com/cve/CVE-2019-14831/"], 0], ["CVE-2019-14830", "", "Not required", "A vulnerability was found in Moodle 3.7 to 3.7.1, 3.6 to 3.6.5, 3.5 to 3.5.7 and earlier unsupported versions, where the mobile launch endpoint contained an open redirect in some circumstances, which could result in a user's mobile access token being exposed. (Note: This does not affect sites with a forced URL scheme configured, mobile service disabled, or where the mobile app login method is \"via the app\").", [], ["https://www.cvedetails.com/cve/CVE-2019-14830/"], 0], ["CVE-2019-14829", "", "???", "A vulnerability was found in Moodle affection 3.7 to 3.7.1, 3.6 to 3.6.5, 3.5 to 3.5.7 and earlier unsupported versions where activity creation capabilities were not correctly respected when selecting the activity to use for a course in single activity mode.", [], ["https://www.cvedetails.com/cve/CVE-2019-14829/"], 0], ["CVE-2019-14828", "", "???", "A vulnerability was found in Moodle affecting 3.7 to 3.7.1, 3.6 to 3.6.5, 3.5 to 3.5.7 and earlier unsupported versions, where users with the capability to create courses were assigned as a teacher in those courses, regardless of whether they had the capability to be automatically assigned that role.", [], ["https://www.cvedetails.com/cve/CVE-2019-14828/"], 0], ["CVE-2019-10189", "", "???", "A flaw was found in moodle before versions 3.7.1, 3.6.5, 3.5.7. Teachers in an assignment group could modify group overrides for other groups in the same assignment.", [], ["https://www.cvedetails.com/cve/CVE-2019-10189/"], 0], ["CVE-2019-10188", "", "???", "A flaw was found in moodle before versions 3.7.1, 3.6.5, 3.5.7. Teachers in a quiz group could modify group overrides for other groups in the same quiz.", [], ["https://www.cvedetails.com/cve/CVE-2019-10188/"], 0], ["CVE-2019-10187", "", "???", "A flaw was found in moodle before versions 3.7.1, 3.6.5, 3.5.7. Users with permission to delete entries from a glossary were able to delete entries from other glossaries they did not have direct access to.", [], ["https://www.cvedetails.com/cve/CVE-2019-10187/"], 0], ["CVE-2019-10186", "CSRF", "Not required", "A flaw was found in moodle before versions 3.7.1, 3.6.5, 3.5.7. A sesskey (CSRF) token was not being utilised by the XML loading/unloading admin tool.", [], ["https://www.cvedetails.com/cve/CVE-2019-10186/"], 0], ["CVE-2019-10154", "", "Not required", "A flaw was found in Moodle before versions 3.7, 3.6.4. A web service fetching messages was not restricted to the current user's conversations.", [], ["https://www.cvedetails.com/cve/CVE-2019-10154/"], 0], ["CVE-2019-10134", "", "Not required", "A flaw was found in Moodle before 3.7, 3.6.4, 3.5.6, 3.4.9 and 3.1.18. The size of users' private file uploads via email were not correctly checked, so their quota allowance could be exceeded.", [], ["https://www.cvedetails.com/cve/CVE-2019-10134/"], 0], ["CVE-2019-10133", "", "Not required", "A flaw was found in Moodle before 3.7, 3.6.4, 3.5.6, 3.4.9 and 3.1.18. The form to upload cohorts contained a redirect field, which was not restricted to internal URLs.", [], ["https://www.cvedetails.com/cve/CVE-2019-10133/"], 0], ["CVE-2019-6970", "", "???", "Moodle 3.5.x before 3.5.4 allows SSRF.", [], ["https://www.cvedetails.com/cve/CVE-2019-6970/"], 0], ["CVE-2019-3852", "", "???", "A vulnerability was found in moodle before version 3.6.3. The get_with_capability_join and get_users_by_capability functions were not taking context freezing into account when checking user capabilities", [], ["https://www.cvedetails.com/cve/CVE-2019-3852/"], 0], ["CVE-2019-3851", "", "???", "A vulnerability was found in moodle before versions 3.6.3 and 3.5.5. There was a link to site home within the the Boost theme's secure layout, meaning students could navigate out of the page.", [], ["https://www.cvedetails.com/cve/CVE-2019-3851/"], 0], ["CVE-2019-3850", "", "Not required", "A vulnerability was found in moodle before versions 3.6.3, 3.5.5, 3.4.8 and 3.1.17. Links within assignment submission comments would open directly (in the same window). Although links themselves may be valid, opening within the same window and without the no-referrer header policy made them more susceptible to exploits.", [], ["https://www.cvedetails.com/cve/CVE-2019-3850/"], 0], ["CVE-2019-3849", "", "???", "A vulnerability was found in moodle before versions 3.6.3, 3.5.5 and 3.4.8. Users could assign themselves an escalated role within courses or content accessed via LTI, by modifying the request to the LTI publisher site.", [], ["https://www.cvedetails.com/cve/CVE-2019-3849/"], 0], ["CVE-2019-3848", "+Info", "???", "A vulnerability was found in moodle before versions 3.6.3, 3.5.5 and 3.4.8. Permissions were not correctly checked before loading event information into the calendar's edit event modal popup, so logged in non-guest users could view unauthorised calendar events. (Note: It was read-only access, users could not edit the events.)", [], ["https://www.cvedetails.com/cve/CVE-2019-3848/"], 0], ["CVE-2019-3847", "", "???", "A vulnerability was found in moodle before versions 3.6.3, 3.5.5, 3.4.8 and 3.1.17. Users with the \"login as other users\" capability (such as administrators/managers) can access other users' Dashboards, but the JavaScript those other users may have added to their Dashboard was not being escaped when being viewed by the user logging in on their behalf.", [], ["https://www.cvedetails.com/cve/CVE-2019-3847/"], 0], ["CVE-2019-3810", "", "Not required", "A flaw was found in moodle versions 3.6 to 3.6.1, 3.5 to 3.5.3, 3.4 to 3.4.6, 3.1 to 3.1.15 and earlier unsupported versions. The /userpix/ page did not escape users' full names, which are included as text when hovering over profile images. Note this page is not linked to by default and its access is restricted.", [], ["https://www.cvedetails.com/cve/CVE-2019-3810/"], 0], ["CVE-2019-3809", "", "Not required", "A flaw was found in Moodle versions 3.1 to 3.1.15 and earlier unsupported versions. The mybackpack functionality allowed setting the URL of badges, when it should be restricted to the Mozilla Open Badges backpack URL. This resulted in the possibility of blind SSRF via requests made by the page.", [], ["https://www.cvedetails.com/cve/CVE-2019-3809/"], 0]]